[
  {
    "name": "SCRUM",
    "description": "Scrum es un proceso de gestión que reduce la complejidad en el desarrollo de productos para satisfacer las necesidades de los clientes.",
    "picture": "https://th.bing.com/th/id/R.8985972bc7df999cdcc9acdcfa553447?rik=i7Vk9xh8oxeaBA&pid=ImgRaw&r=0",
    "phases": [
      {
        "name": "Planning Sprint (Planeacion)",
        "description": {
          "paragraphs": [
            {
              "text": "En esta etapa analizamos los requerimientos dictados por nuestro cliente y se definen los roles que se asignaran entre todos los integrantes de nuestro equipos, por ultimo se organizará la forma en la que se empezara ejecutar el proyecto.",
              "resource": null,
              "questions": [
                "¿Cuál será el resultado final del proyecto?",
                "¿Cómo se va a realizar el proyecto?",
                "¿Quiénes son las personas que conformarán el equipo Scrum?",
                "¿Cuánto tiempo se tiene para lograr el proyecto?"
               ]
            },
            {
              "text": "Scrum funciona a partir de una \"lista de tareas\" que se divide entre todo el equipo, esta lista es llamada <b>product backlog</b> y contiene todas las caracteristicas y descripciones hechas por nuestro equipo y nuestro cliente. Esta lista tiende a cambiar, dependiendo de las nuevas propuestas del cliente y nuevos problemas en el desarrollo del producto.",
              "resource": {
                "type": "video",
                "link": "https://www.youtube.com/embed/oIIoOJx-U3E"
              },
              "questions": []
            }
          ]
        }
      },
      {
        "name": "Sprint (Ejecucion)",
        "description": {
          "paragraphs": [
            {
              "text": "Durante el Sprint se crea un incremento del producto, que sea utilizable y potencialmente entregable. Tambien durante esta etapa, iremos modificando nuestro <b>product backlog</b> a medida que descartemos o agreguemos nuevos errores o problemas.",
              "questions": []
            }
          ]
        }
      },
      {
        "name": "Daily Meeting (Reunion Diaria)",
        "description": {
          "paragraphs": [
            {
              "text": "El propósito de esta fase es el de transmitir los avances del proyecto para abrirse a la colaboración y aumentar la productividad del equipo, además de ayudarse unos a otros. A cada miembro se le hace una serie de preguntas con el objetivo de comprender la situación del individuo ya que este es una parte fundamental del equipo y se necesita solucionar esas limitantes de este:",
              "questions": [
                "¿De qué manera ha contribuido al proyecto desde la última reunión?",
                "¿Qué hará a partir de ese momento para ayudar al equipo a cumplir su objetivo?",
                "¿Qué limitantes o problemas tiene que le impida realizar sus tareas pendientes en la contribución del proyecto?"
              ]
            },
            {
              "text": "Esta fase aumenta mucho la productividad del equipo, busca siempre la solución a problemas empezando desde lo individual hasta lo colectivo ya que sin miembros no hay equipo. Pero un <u>problema que esta vigente</u> es el nulo interés del miembro por realizar sus tareas o actividades que se le indican, haciendo así que esta fase requiera de una buena comunicación en el equipo. ",
              "resource": {
                "type": "picture",
                "link": "https://images.unsplash.com/photo-1552664730-d307ca884978?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80"
              },
              "questions": []
            }
          ]
        }
      },
      {
        "name": "Sprint Review (Reunión Informal)",
        "description": {
          "paragraphs": [
            {
              "text": "Esta es una reunión en la cual se muestran los avances del proyecto con el propósito de obtener feedback tanto del cliente como del equipo desarrollador. Después de esta se vuelven a repetir todas estas fases anteriormente mencionadas haciendo que se haga una iteración al ciclo de SCRUM (las iteraciones también se conocen como “sprint”).",
              "resource": {
                "type": "picture",
                "link": "https://th.bing.com/th/id/OIP.I1vpVSSqgmnz-ZIy3EgmwwHaEK?pid=ImgDet&rs=1"
              },
              "questions": []
            }
          ]
        }
      }
    ]
  },
  {
    "name": "Cascada",
    "description": "El modelo de cascada es un sistema lineal para la gestión de proyectos que puede ser útil para que el equipo pueda cumplir los objetivos compartidos; una tarea o hito a la vez. Este enfoque para la gestión de proyectos surgió a partir de los sectores de fabricación y construcción, en los que cada hito debe estar finalizado para poder avanzar con el proceso de producción, ya que <u>\"no puedes construir las paredes de una casa sin los cimientos\"</u>. A pesar su origen, la gestión de proyectos cascada se ha adaptado a las necesidades de muchos otros sectores diferentes, incluso al del desarrollo de software.",
    "picture": "https://d33wubrfki0l68.cloudfront.net/6a7bbf7f19b0b820ea446eda6a2a21df679af2eb/b0c8a/wp-content/uploads/2016/02/modelo_de_desarrollo_en_cascada.jpg",
    "phases": [
      {
        "name": "Requerimientos",
        "description": {
          "paragraphs": [
            {
              "text": "Es el proceso de planificación inicial en el que los miembros del equipo reúnen toda la información posible para garantizar el éxito del proyecto. Como las tareas del método de cascada dependen de los pasos anteriores, hay que prever todo en detalle antes de empezar. Este proceso de planificación es una etapa crucial de la metodología de cascada y por ese motivo, la mayor parte del tiempo del proyecto se dedica a la planificación. Al finalizar la fase de requerimientos, deberías tener un esquema muy claro del proyecto de principio a fin que incluya lo siguiente:",
              "questions": [
                "Cada etapa del proceso",
                "Quién trabajará en cada etapa",
                "Las dependencias clave",
                "Los recursos necesarios",
                "Un cronograma en el que se detalle cuánto tiempo durará cada etapa"
              ]
            }
          ]
        }
      },
      {
        "name": "Diseño",
        "description": {
          "paragraphs": [
            {
              "text": "En esta etapa el equipo especifica qué hardware utilizará, además de cualquier otro detalle, como los lenguajes de programación y la interfaz de usuario. La fase de diseño de alto nivel y la de diseño detallado. En la fase de diseño de alto nivel, el equipo elabora un esqueleto de cómo funcionará el software y cómo se accederá a la información.",
              "resource": {
                "type": "picture",
                "link": "https://images.unsplash.com/photo-1432888498266-38ffec3eaf0a?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=874&q=80"
              },
              "questions": []
            },
            {
              "text": "Durante la fase de diseño detallado, el equipo define los detalles particulares del software. Si la fase de diseño de alto nivel es el esqueleto, la de diseño detallado se refiere a los órganos del proyecto. Los miembros de los equipos que hacen sus desarrollos aplicando esta metodología deben documentar cada paso para que el resto del equipo pueda consultar qué se ha hecho a medida que el proyecto avanza.",
              "resource": null,
              "questions": []
            }
          ]
        }
      },
      {
        "name": "Implementación",
        "description": {
          "paragraphs": [
            {
              "text": "Esta es la fase en que todo entra en acción. Según los documentos de requerimientos del paso uno y del proceso de diseño del sistema del paso dos, el equipo inicia un proceso de desarrollo pleno para elaborar el software que se ha previsto tanto en la fase de requerimientos como en la de diseño del sistema.",
              "resource": {
                "type": "picture",
                "link": "https://images.unsplash.com/photo-1580983561371-7f4b242d8ec0?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80"
              },
              "questions": []
            }
          ]
        }
      },
      {
        "name": "Pruebas",
        "description": {
          "paragraphs": [
            {
              "text": "El equipo del proyecto al equipo de Calidad para que realice las pruebas pertinentes. Los ‘QA testers’ buscan cualquier error que deba repararse antes de la implementación del proyecto.",
              "resource": null,
              "questions": []
            },
            {
              "text": "Los encargados de las pruebas documentan con claridad todos los problemas que encuentran al realizar el control de calidad. En caso de que otro desarrollador se encuentre con un error similar, podrá consultar la documentación anterior para corregir el error.",
              "resource": null,
              "questions": []
            }
          ]
        }
      },
      {
        "name": "Despliegue",
        "description": {
          "paragraphs": [
            {
              "text": "En los proyectos de desarrollo, esta es la etapa en la que se implementa el software para los usuarios finales. En otros casos, es el momento en que se lanza el entregable definitivo a los clientes finales.",
              "resource": null,
              "questions": []
            }
          ]
        }
      },
      {
        "name": "Mantenimiento",
        "description": {
          "paragraphs": [
            {
              "text": "Una vez que el proyecto se ha lanzado para su implementación, puede haber instancias en las que se descubra algún error nuevo o en las que sea necesario realizar alguna actualización del software. A esto se lo conoce como fase de mantenimiento y es muy común, en el desarrollo de software, que el trabajo de esta etapa sea continuo.",
              "resource": {
                "type": "picture",
                "link": "https://images.unsplash.com/photo-1556636530-6b7482d80e3d?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80"
              },
              "questions": []
            }
          ]
        }
      }
    ]
  }
]
