[
  {
    "name": "SCRUM",
    "description": "Scrum es un proceso de gestión que reduce la complejidad en el desarrollo de productos para satisfacer las necesidades de los clientes.",
    "picture": "https://images.unsplash.com/photo-1552664730-d307ca884978?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=870&q=80",
    "phases": [
      {
        "name": "Planning Sprint (Planeacion)",
        "description": {
          "paragraphs": [
            {
              "text": "En esta etapa analizamos los requerimientos dictados por nuestro cliente y se definen los roles que se asignaran entre todos los integrantes de nuestro equipos, por ultimo se organizará la forma en la que se empezara ejecutar el proyecto.",
              "questions": [
                "¿Cuál será el resultado final del proyecto?",
                "¿Cómo se va a realizar el proyecto?",
                "¿Quiénes son las personas que conformarán el equipo Scrum?",
                "¿Cuánto tiempo se tiene para lograr el proyecto?"
               ]
            },
            {
              "text": "Scrum funciona a partir de una \"lista de tareas\" que se divide entre todo el equipo, esta lista es llamada <b>product backlog</b> y contiene todas las caracteristicas y descripciones hechas por nuestro equipo y nuestro cliente. Esta lista tiende a cambiar, dependiendo de las nuevas propuestas del cliente y nuevos problemas en el desarrollo del producto.",
               "questions": []
            }
          ]
        }
      },
      {
        "name": "Sprint (Ejecucion)",
        "description": {
          "paragrahs": [
            {
              "text": "Durante el Sprint se crea un incremento del producto, que sea utilizable y potencialmente entregable. Tambien durante esta etapa, iremos modificando nuestro <b>product backlog</b> a medida que descartemos o agreguemos nuevos errores o problemas.",
              "questions": []
            }
          ]
        }
      }
    ]
  }
]
